[
    {
        "title": "Intro to Philosphy",
        "subject": "Phiolosphy",
        "name": "PHIL 5",
        "department": "Letters of Arts & Science",
        "description": "An introduction to the Philosophy of Science. Students will learn the basic principles of philosphy and how to write philosophical papers."
    },
    {
        "title": "Advanced Quantum Mechanics",
        "subject": "Physics",
        "name": "PHYS 410",
        "department": "Department of Physical Sciences",
        "description": "A comprehensive study of quantum mechanics, including the mathematical foundations and advanced topics such as quantum field theory and perturbation theory. Students will explore the principles and applications of quantum mechanics in various physical systems and phenomena."
    },
    {
        "title": "Contemporary Political Theory",
        "subject": "Political Science",
        "name": "POLI 320",
        "department": "Department of Political Science",
        "description": "An in-depth examination of major theories and debates in contemporary political thought. This course covers key concepts, such as justice, power, and democracy, and analyzes the works of influential political theorists from the 20th and 21st centuries."
    },
    {
        "title": "Modern Data Structures",
        "subject": "Computer Science",
        "name": "CSCI 305",
        "department": "Department of Computer Science",
        "description": "An exploration of advanced data structures and algorithms, focusing on their design, implementation, and analysis. Topics include balanced trees, hash tables, graphs, and priority queues, with practical applications in software development and problem-solving."
    },
    {
        "title": "Cultural Anthropology: Theory and Method",
        "subject": "Anthropology",
        "name": "ANTH 250",
        "department": "Department of Anthropology",
        "description": "A critical examination of the theories and methodologies used in cultural anthropology. Students will study various ethnographic methods, theoretical frameworks, and the application of anthropological insights to understand diverse cultures and societies."
    },
    {
        "title": "Neuroscience of Behavior",
        "subject": "Neuroscience",
        "name": "NEUR 330",
        "department": "Department of Neuroscience",
        "description": "An exploration of the neural mechanisms underlying behavior. Topics include sensory and motor systems, emotion, cognition, and neuroplasticity. The course integrates experimental research and clinical case studies to understand how brain function influences behavior."
    },
    {
        "title": "Environmental Policy and Management",
        "subject": "Environmental Science",
        "name": "ENVS 420",
        "department": "Department of Environmental Science",
        "description": "A study of the development, implementation, and impact of environmental policies and management strategies. Students will analyze case studies, explore policy frameworks, and evaluate the effectiveness of various approaches to managing natural resources and addressing environmental issues."
    }
]